app/views/users/show.html.erb

<% else %>
<% @memories = @user.memories.where(private: false) %>
---
SELECT "memories".* FROM "memories" WHERE "memories"."user_id" = $1 AND "memories"."private" = $2  [["user_id", 1], ["private", "f"]]