app/controllers/memories_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 11]]
---
  def index
    # binding.pry
    @user = User.find_by(id: session[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 11]]
SELECT  "memories".* FROM "memories" WHERE "memories"."id" = $1 LIMIT 1  [["id", 11]]
---
  def show
    @user = User.find_by(id: params[:user_id])
    @memory = Memory.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 11]]
---
  def new
    binding.pry
    @user = User.find_by(id: session[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "memories".* FROM "memories" WHERE "memories"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    # binding.pry

    @user = User.find_by(id: params[:user_id])
    @memory = Memory.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "memories" ("title", "url", "description", "story", "private", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    # binding.pry
    @user = User.find_by(id: params[:user_id])
    @memory = Memory.new(memory_params)
    @memory.user_id = @user.id
    respond_to do |format|
      if @memory.save

SELECT  "memories".* FROM "memories" WHERE "memories"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "memories" SET "story" = $1, "updated_at" = $2 WHERE "memories"."id" = $3  [["story", "I changed thi shiet"], ["updated_at", "2016-04-03 23:45:32.901905"], ["id", 10]]
---
  def update
    @memory = Memory.find_by(id: params[:id])
    @user = User.find_by(id: params[:user_id])
    respond_to do |format|
      if @memory.update(memory_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "memories".* FROM "memories" WHERE "memories"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "memories" WHERE "memories"."id" = $1  [["id", 1]]
---
  def destroy
    # binding.pry
    @user = User.find_by(id: params[:user_id])
    @memory = Memory.find_by(id: params[:id])
    @memory.destroy