app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    # binding.pry
     p '*' * 50
    p session[:id]
    p '*' * 50

    @user = User.find_by(id: params[:id])

INSERT INTO "users" ("email", "first_name", "last_name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$y3s64qVPBMzJ/gdVa6biJ.tkzBxbDej6eCrzigpdG9WWKHDSeCvPW"], ["updated_at", "2016-04-02 17:02:23.062635"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_user
      if @user
      @user = User.find(params[:id])